# Задайте натуральное число N. Напишите программу, которая составит 
# список простых множителей числа N.
# N = 6 | N = 12 | 32 | 13 | 9 | 18 | 21
# 2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7

num = int(input('Введите число :  '))
div = 2
col = []

while div <= num:
    if num % div == 0:
        col.append(div)
        num //= div
    else:
        div += 1   
print(*col)         