# 3) Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:    - 6782 -> 23      - 0, 56 -> 11

# nam = list(lambda i: )

num = input()
ls = list(map(float, num))
print(ls)
